
public class Main {
	public static int Randam(){
		
		int i1 = (int)Math.random();//random表示一个随机数发生器，能以概率p生成0，以概率1-p生成1，
		int i2 = (int)Math.random();
		/**
		 * 现设计随机数发生器，使得生成的0和1概率相等
		 * 解决方法：用原生的发生器周期性的产生2个数，直到生成01或10
		 * 生成01概率p*(1-p)，生成10概率p*(1-p)，概率相同
		 * 所以可以指定01表示0，10表示1
		 * 即可等概率生成0和1
		 * int Rand()
			{
				int i1 = rand();
				int i2 = rand();
				if(i1==0 && i2==1)
					return 1;
				else if(i1==1 && i2==0)
					return 0;
				else
					return Rand();
				return -1;
			}
		 * */
		
		
		/**
		 * 用上面那个生成0和1的概率相等的随机数发生器，怎样做一个随机数发生器使得它生成的数在1到N之间均匀分布
		 * 解决方法：通过位运算，因为i个二进制位随机的选择0和1，可以随机的构成0到2^i的数，而这些数构成了所有的组合数。因此是等概率出现的
		 * 比如：2位二进制数，这两位可以随机为0或1而互不影响，随机的构成00  01  10  11，这四个数是等概率的
		 * */
		return 0;
	}
}
